# GetDirectContext3DHandleOverrides Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..GetDirectContext3DHandleOverrides Method
View Class See Also
---
Returns DirectContext3D handle overrides object for the view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public DirectContext3DHandleOverrides GetDirectContext3DHandleOverrides()
```

Visual Basic
---
```text
Public Function GetDirectContext3DHandleOverrides As DirectContext3DHandleOverrides
```

Visual C++
---
```text
public:
DirectContext3DHandleOverrides^ GetDirectContext3DHandleOverrides()
```

# ### Return Value
DirectContext3D handle overrides for the view
# See Also
View Class
Autodesk.Revit.DB Namespace